**Terraform Plan Output**
```
[command]/home/runner/work/_temp/dde812f9-78be-40f7-a664-848967b22b27/terraform-bin plan -out=tfplan -var=grafana_admin_password=admin123
[0m[1mdata.aws_availability_zones.available: Reading...[0m[0m
[0m[1mdata.aws_availability_zones.available: Read complete after 1s [id=ap-south-1][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.aws_eks_cluster.sre[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_cluster" "sre" {
      [32m+[0m[0m access_config             = (known after apply)
      [32m+[0m[0m arn                       = (known after apply)
      [32m+[0m[0m certificate_authority     = (known after apply)
      [32m+[0m[0m cluster_id                = (known after apply)
      [32m+[0m[0m compute_config            = (known after apply)
      [32m+[0m[0m created_at                = (known after apply)
      [32m+[0m[0m enabled_cluster_log_types = (known after apply)
      [32m+[0m[0m endpoint                  = (known after apply)
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m identity                  = (known after apply)
      [32m+[0m[0m kubernetes_network_config = (known after apply)
      [32m+[0m[0m name                      = "sre-cluster"
      [32m+[0m[0m outpost_config            = (known after apply)
      [32m+[0m[0m platform_version          = (known after apply)
      [32m+[0m[0m remote_network_config     = (known after apply)
      [32m+[0m[0m role_arn                  = (known after apply)
      [32m+[0m[0m status                    = (known after apply)
      [32m+[0m[0m storage_config            = (known after apply)
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m upgrade_policy            = (known after apply)
      [32m+[0m[0m version                   = (known after apply)
      [32m+[0m[0m vpc_config                = (known after apply)
      [32m+[0m[0m zonal_shift_config        = (known after apply)
    }

[1m  # data.aws_eks_cluster_auth.sre[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_cluster_auth" "sre" {
      [32m+[0m[0m id    = (known after apply)
      [32m+[0m[0m name  = "sre-cluster"
      [32m+[0m[0m token = (sensitive value)
    }

[1m  # aws_eks_cluster.sre[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_cluster" "sre" {
      [32m+[0m[0m arn                           = (known after apply)
      [32m+[0m[0m bootstrap_self_managed_addons = true
      [32m+[0m[0m certificate_authority         = (known after apply)
      [32m+[0m[0m cluster_id                    = (known after apply)
      [32m+[0m[0m created_at                    = (known after apply)
      [32m+[0m[0m endpoint                      = (known after apply)
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m identity                      = (known after apply)
      [32m+[0m[0m name                          = "sre-cluster"
      [32m+[0m[0m platform_version              = (known after apply)
      [32m+[0m[0m role_arn                      = (known after apply)
      [32m+[0m[0m status                        = (known after apply)
      [32m+[0m[0m tags_all                      = (known after apply)
      [32m+[0m[0m version                       = (known after apply)

      [32m+[0m[0m vpc_config {
          [32m+[0m[0m cluster_security_group_id = (known after apply)
          [32m+[0m[0m endpoint_private_access   = false
          [32m+[0m[0m endpoint_public_access    = true
          [32m+[0m[0m public_access_cidrs       = (known after apply)
          [32m+[0m[0m subnet_ids                = (known after apply)
          [32m+[0m[0m vpc_id                    = (known after apply)
        }
    }

[1m  # aws_eks_node_group.sre_nodes[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_node_group" "sre_nodes" {
      [32m+[0m[0m ami_type               = (known after apply)
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m capacity_type          = (known after apply)
      [32m+[0m[0m cluster_name           = "sre-cluster"
      [32m+[0m[0m disk_size              = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_types         = [
          [32m+[0m[0m "t3.micro",
        ]
      [32m+[0m[0m node_group_name        = "sre-nodes"
      [32m+[0m[0m node_group_name_prefix = (known after apply)
      [32m+[0m[0m node_role_arn          = (known after apply)
      [32m+[0m[0m release_version        = (known after apply)
      [32m+[0m[0m resources              = (known after apply)
      [32m+[0m[0m status                 = (known after apply)
      [32m+[0m[0m subnet_ids             = (known after apply)
      [32m+[0m[0m tags_all               = (known after apply)
      [32m+[0m[0m version                = (known after apply)

      [32m+[0m[0m scaling_config {
          [32m+[0m[0m desired_size = 1
          [32m+[0m[0m max_size     = 1
          [32m+[0m[0m min_size     = 1
        }
    }

[1m  # aws_iam_role.eks_cluster_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "eks_cluster_role" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "eks.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "eks-cluster-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # aws_iam_role.eks_node_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "eks_node_role" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "eks-node-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # aws_iam_role_policy_attachment.cni_attach[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "cni_attach" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      [32m+[0m[0m role       = "eks-node-role"
    }

[1m  # aws_iam_role_policy_attachment.eks_cluster_attach[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "eks_cluster_attach" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      [32m+[0m[0m role       = "eks-cluster-role"
    }

[1m  # aws_iam_role_policy_attachment.node_attach[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "node_attach" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      [32m+[0m[0m role       = "eks-node-role"
    }

[1m  # aws_subnet.public[0][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "ap-south-1a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.0.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = true
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "sre-public-subnet-0"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name" = "sre-public-subnet-0"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # aws_subnet.public[1][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "ap-south-1b"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.1.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = true
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "sre-public-subnet-1"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name" = "sre-public-subnet-1"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # aws_vpc.main[0m will be created
[0m  [32m+[0m[0m resource "aws_vpc" "main" {
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m cidr_block                           = "10.0.0.0/16"
      [32m+[0m[0m default_network_acl_id               = (known after apply)
      [32m+[0m[0m default_route_table_id               = (known after apply)
      [32m+[0m[0m default_security_group_id            = (known after apply)
      [32m+[0m[0m dhcp_options_id                      = (known after apply)
      [32m+[0m[0m enable_dns_hostnames                 = true
      [32m+[0m[0m enable_dns_support                   = true
      [32m+[0m[0m enable_network_address_usage_metrics = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_tenancy                     = "default"
      [32m+[0m[0m ipv6_association_id                  = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_network_border_group = (known after apply)
      [32m+[0m[0m main_route_table_id                  = (known after apply)
      [32m+[0m[0m owner_id                             = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "sre-vpc"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Name" = "sre-vpc"
        }
    }

[1m  # helm_release.prom_stack[0m will be created
[0m  [32m+[0m[0m resource "helm_release" "prom_stack" {
      [32m+[0m[0m atomic                     = false
      [32m+[0m[0m chart                      = "kube-prometheus-stack"
      [32m+[0m[0m cleanup_on_fail            = false
      [32m+[0m[0m create_namespace           = false
      [32m+[0m[0m dependency_update          = false
      [32m+[0m[0m disable_crd_hooks          = false
      [32m+[0m[0m disable_openapi_validation = false
      [32m+[0m[0m disable_webhooks           = false
      [32m+[0m[0m force_update               = false
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m lint                       = false
      [32m+[0m[0m manifest                   = (known after apply)
      [32m+[0m[0m max_history                = 0
      [32m+[0m[0m metadata                   = (known after apply)
      [32m+[0m[0m name                       = "monitoring"
      [32m+[0m[0m namespace                  = "monitoring"
      [32m+[0m[0m pass_credentials           = false
      [32m+[0m[0m recreate_pods              = false
      [32m+[0m[0m render_subchart_notes      = true
      [32m+[0m[0m replace                    = false
      [32m+[0m[0m repository                 = "https://prometheus-community.github.io/helm-charts"
      [32m+[0m[0m reset_values               = false
      [32m+[0m[0m reuse_values               = false
      [32m+[0m[0m skip_crds                  = false
      [32m+[0m[0m status                     = "deployed"
      [32m+[0m[0m timeout                    = 300
      [32m+[0m[0m values                     = [
          [32m+[0m[0m <<-EOT
                grafana:
                  adminPassword: "admin123"
                  service:
                    type: NodePort
                    nodePort: 32000
                prometheus:
                  service:
                    type: NodePort
                    nodePort: 32001
            EOT,
        ]
      [32m+[0m[0m verify                     = false
      [32m+[0m[0m version                    = "47.3.0"
      [32m+[0m[0m wait                       = true
      [32m+[0m[0m wait_for_jobs              = false
    }

[1m  # kubernetes_namespace.application[0m will be created
[0m  [32m+[0m[0m resource "kubernetes_namespace" "application" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m wait_for_default_service_account = false

      [32m+[0m[0m metadata {
          [32m+[0m[0m generation       = (known after apply)
          [32m+[0m[0m name             = "application"
          [32m+[0m[0m resource_version = (known after apply)
          [32m+[0m[0m uid              = (known after apply)
        }
    }

[1m  # kubernetes_namespace.monitoring[0m will be created
[0m  [32m+[0m[0m resource "kubernetes_namespace" "monitoring" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m wait_for_default_service_account = false

      [32m+[0m[0m metadata {
          [32m+[0m[0m generation       = (known after apply)
          [32m+[0m[0m name             = "monitoring"
          [32m+[0m[0m resource_version = (known after apply)
          [32m+[0m[0m uid              = (known after apply)
        }
    }

[1mPlan:[0m 13 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m grafana_port_forward_command = "kubectl port-forward -n monitoring svc/monitoring-grafana 3000:80"
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: [0m[1mdata.aws_availability_zones.available: Reading...[0m[0m%0A[0m[1mdata.aws_availability_zones.available: Read complete after 1s [id=ap-south-1][0m%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create[0m%0A [36m<=[0m read (data resources)[0m%0A%0ATerraform will perform the following actions:%0A%0A[1m  # data.aws_eks_cluster.sre[0m will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A[0m [36m<=[0m[0m data "aws_eks_cluster" "sre" {%0A      [32m+[0m[0m access_config             = (known after apply)%0A      [32m+[0m[0m arn                       = (known after apply)%0A      [32m+[0m[0m certificate_authority     = (known after apply)%0A      [32m+[0m[0m cluster_id                = (known after apply)%0A      [32m+[0m[0m compute_config            = (known after apply)%0A      [32m+[0m[0m created_at                = (known after apply)%0A      [32m+[0m[0m enabled_cluster_log_types = (known after apply)%0A      [32m+[0m[0m endpoint                  = (known after apply)%0A      [32m+[0m[0m id                        = (known after apply)%0A      [32m+[0m[0m identity                  = (known after apply)%0A      [32m+[0m[0m kubernetes_network_config = (known after apply)%0A      [32m+[0m[0m name                      = "sre-cluster"%0A      [32m+[0m[0m outpost_config            = (known after apply)%0A      [32m+[0m[0m platform_version          = (known after apply)%0A      [32m+[0m[0m remote_network_config     = (known after apply)%0A      [32m+[0m[0m role_arn                  = (known after apply)%0A      [32m+[0m[0m status                    = (known after apply)%0A      [32m+[0m[0m storage_config            = (known after apply)%0A      [32m+[0m[0m tags                      = (known after apply)%0A      [32m+[0m[0m upgrade_policy            = (known after apply)%0A      [32m+[0m[0m version                   = (known after apply)%0A      [32m+[0m[0m vpc_config                = (known after apply)%0A      [32m+[0m[0m zonal_shift_config        = (known after apply)%0A    }%0A%0A[1m  # data.aws_eks_cluster_auth.sre[0m will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A[0m [36m<=[0m[0m data "aws_eks_cluster_auth" "sre" {%0A      [32m+[0m[0m id    = (known after apply)%0A      [32m+[0m[0m name  = "sre-cluster"%0A      [32m+[0m[0m token = (sensitive value)%0A    }%0A%0A[1m  # aws_eks_cluster.sre[0m will be created%0A[0m  [32m+[0m[0m resource "aws_eks_cluster" "sre" {%0A      [32m+[0m[0m arn                           = (known after apply)%0A      [32m+[0m[0m bootstrap_self_managed_addons = true%0A      [32m+[0m[0m certificate_authority         = (known after apply)%0A      [32m+[0m[0m cluster_id                    = (known after apply)%0A      [32m+[0m[0m created_at                    = (known after apply)%0A      [32m+[0m[0m endpoint                      = (known after apply)%0A      [32m+[0m[0m id                            = (known after apply)%0A      [32m+[0m[0m identity                      = (known after apply)%0A      [32m+[0m[0m name                          = "sre-cluster"%0A      [32m+[0m[0m platform_version              = (known after apply)%0A      [32m+[0m[0m role_arn                      = (known after apply)%0A      [32m+[0m[0m status                        = (known after apply)%0A      [32m+[0m[0m tags_all                      = (known after apply)%0A      [32m+[0m[0m version                       = (known after apply)%0A%0A      [32m+[0m[0m vpc_config {%0A          [32m+[0m[0m cluster_security_group_id = (known after apply)%0A          [32m+[0m[0m endpoint_private_access   = false%0A          [32m+[0m[0m endpoint_public_access    = true%0A          [32m+[0m[0m public_access_cidrs       = (known after apply)%0A          [32m+[0m[0m subnet_ids                = (known after apply)%0A          [32m+[0m[0m vpc_id                    = (known after apply)%0A        }%0A    }%0A%0A[1m  # aws_eks_node_group.sre_nodes[0m will be created%0A[0m  [32m+[0m[0m resource "aws_eks_node_group" "sre_nodes" {%0A      [32m+[0m[0m ami_type               = (known after apply)%0A      [32m+[0m[0m arn                    = (known after apply)%0A      [32m+[0m[0m capacity_type          = (known after apply)%0A      [32m+[0m[0m cluster_name           = "sre-cluster"%0A      [32m+[0m[0m disk_size              = (known after apply)%0A      [32m+[0m[0m id                     = (known after apply)%0A      [32m+[0m[0m instance_types         = [%0A          [32m+[0m[0m "t3.micro",%0A        ]%0A      [32m+[0m[0m node_group_name        = "sre-nodes"%0A      [32m+[0m[0m node_group_name_prefix = (known after apply)%0A      [32m+[0m[0m node_role_arn          = (known after apply)%0A      [32m+[0m[0m release_version        = (known after apply)%0A      [32m+[0m[0m resources              = (known after apply)%0A      [32m+[0m[0m status                 = (known after apply)%0A      [32m+[0m[0m subnet_ids             = (known after apply)%0A      [32m+[0m[0m tags_all               = (known after apply)%0A      [32m+[0m[0m version                = (known after apply)%0A%0A      [32m+[0m[0m scaling_config {%0A          [32m+[0m[0m desired_size = 1%0A          [32m+[0m[0m max_size     = 1%0A          [32m+[0m[0m min_size     = 1%0A        }%0A    }%0A%0A[1m  # aws_iam_role.eks_cluster_role[0m will be created%0A[0m  [32m+[0m[0m resource "aws_iam_role" "eks_cluster_role" {%0A      [32m+[0m[0m arn                   = (known after apply)%0A      [32m+[0m[0m assume_role_policy    = jsonencode(%0A            {%0A              [32m+[0m[0m Statement = [%0A                  [32m+[0m[0m {%0A                      [32m+[0m[0m Action    = "sts:AssumeRole"%0A                      [32m+[0m[0m Effect    = "Allow"%0A                      [32m+[0m[0m Principal = {%0A                          [32m+[0m[0m Service = "eks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              [32m+[0m[0m Version   = "2012-10-17"%0A            }%0A        )%0A      [32m+[0m[0m create_date           = (known after apply)%0A      [32m+[0m[0m force_detach_policies = false%0A      [32m+[0m[0m id                    = (known after apply)%0A      [32m+[0m[0m managed_policy_arns   = (known after apply)%0A      [32m+[0m[0m max_session_duration  = 3600%0A      [32m+[0m[0m name                  = "eks-cluster-role"%0A      [32m+[0m[0m name_prefix           = (known after apply)%0A      [32m+[0m[0m path                  = "/"%0A      [32m+[0m[0m tags_all              = (known after apply)%0A      [32m+[0m[0m unique_id             = (known after apply)%0A    }%0A%0A[1m  # aws_iam_role.eks_node_role[0m will be created%0A[0m  [32m+[0m[0m resource "aws_iam_role" "eks_node_role" {%0A      [32m+[0m[0m arn                   = (known after apply)%0A      [32m+[0m[0m assume_role_policy    = jsonencode(%0A            {%0A              [32m+[0m[0m Statement = [%0A                  [32m+[0m[0m {%0A                      [32m+[0m[0m Action    = "sts:AssumeRole"%0A                      [32m+[0m[0m Effect    = "Allow"%0A                      [32m+[0m[0m Principal = {%0A                          [32m+[0m[0m Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              [32m+[0m[0m Version   = "2012-10-17"%0A            }%0A        )%0A      [32m+[0m[0m create_date           = (known after apply)%0A      [32m+[0m[0m force_detach_policies = false%0A      [32m+[0m[0m id                    = (known after apply)%0A      [32m+[0m[0m managed_policy_arns   = (known after apply)%0A      [32m+[0m[0m max_session_duration  = 3600%0A      [32m+[0m[0m name                  = "eks-node-role"%0A      [32m+[0m[0m name_prefix           = (known after apply)%0A      [32m+[0m[0m path                  = "/"%0A      [32m+[0m[0m tags_all              = (known after apply)%0A      [32m+[0m[0m unique_id             = (known after apply)%0A    }%0A%0A[1m  # aws_iam_role_policy_attachment.cni_attach[0m will be created%0A[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "cni_attach" {%0A      [32m+[0m[0m id         = (known after apply)%0A      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"%0A      [32m+[0m[0m role       = "eks-node-role"%0A    }%0A%0A[1m  # aws_iam_role_policy_attachment.eks_cluster_attach[0m will be created%0A[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "eks_cluster_attach" {%0A      [32m+[0m[0m id         = (known after apply)%0A      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"%0A      [32m+[0m[0m role       = "eks-cluster-role"%0A    }%0A%0A[1m  # aws_iam_role_policy_attachment.node_attach[0m will be created%0A[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "node_attach" {%0A      [32m+[0m[0m id         = (known after apply)%0A      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"%0A      [32m+[0m[0m role       = "eks-node-role"%0A    }%0A%0A[1m  # aws_subnet.public[0][0m will be created%0A[0m  [32m+[0m[0m resource "aws_subnet" "public" {%0A      [32m+[0m[0m arn                                            = (known after apply)%0A      [32m+[0m[0m assign_ipv6_address_on_creation                = false%0A      [32m+[0m[0m availability_zone                              = "ap-south-1a"%0A      [32m+[0m[0m availability_zone_id                           = (known after apply)%0A      [32m+[0m[0m cidr_block                                     = "10.0.0.0/24"%0A      [32m+[0m[0m enable_dns64                                   = false%0A      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false%0A      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false%0A      [32m+[0m[0m id                                             = (known after apply)%0A      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)%0A      [32m+[0m[0m ipv6_native                                    = false%0A      [32m+[0m[0m map_public_ip_on_launch                        = true%0A      [32m+[0m[0m owner_id                                       = (known after apply)%0A      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)%0A      [32m+[0m[0m tags                                           = {%0A          [32m+[0m[0m "Name" = "sre-public-subnet-0"%0A        }%0A      [32m+[0m[0m tags_all                                       = {%0A          [32m+[0m[0m "Name" = "sre-public-subnet-0"%0A        }%0A      [32m+[0m[0m vpc_id                                         = (known after apply)%0A    }%0A%0A[1m  # aws_subnet.public[1][0m will be created%0A[0m  [32m+[0m[0m resource "aws_subnet" "public" {%0A      [32m+[0m[0m arn                                            = (known after apply)%0A      [32m+[0m[0m assign_ipv6_address_on_creation                = false%0A      [32m+[0m[0m availability_zone                              = "ap-south-1b"%0A      [32m+[0m[0m availability_zone_id                           = (known after apply)%0A      [32m+[0m[0m cidr_block                                     = "10.0.1.0/24"%0A      [32m+[0m[0m enable_dns64                                   = false%0A      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false%0A      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false%0A      [32m+[0m[0m id                                             = (known after apply)%0A      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)%0A      [32m+[0m[0m ipv6_native                                    = false%0A      [32m+[0m[0m map_public_ip_on_launch                        = true%0A      [32m+[0m[0m owner_id                                       = (known after apply)%0A      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)%0A      [32m+[0m[0m tags                                           = {%0A          [32m+[0m[0m "Name" = "sre-public-subnet-1"%0A        }%0A      [32m+[0m[0m tags_all                                       = {%0A          [32m+[0m[0m "Name" = "sre-public-subnet-1"%0A        }%0A      [32m+[0m[0m vpc_id                                         = (known after apply)%0A    }%0A%0A[1m  # aws_vpc.main[0m will be created%0A[0m  [32m+[0m[0m resource "aws_vpc" "main" {%0A      [32m+[0m[0m arn                                  = (known after apply)%0A      [32m+[0m[0m cidr_block                           = "10.0.0.0/16"%0A      [32m+[0m[0m default_network_acl_id               = (known after apply)%0A      [32m+[0m[0m default_route_table_id               = (known after apply)%0A      [32m+[0m[0m default_security_group_id            = (known after apply)%0A      [32m+[0m[0m dhcp_options_id                      = (known after apply)%0A      [32m+[0m[0m enable_dns_hostnames                 = true%0A      [32m+[0m[0m enable_dns_support                   = true%0A      [32m+[0m[0m enable_network_address_usage_metrics = (known after apply)%0A      [32m+[0m[0m id                                   = (known after apply)%0A      [32m+[0m[0m instance_tenancy                     = "default"%0A      [32m+[0m[0m ipv6_association_id                  = (known after apply)%0A      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)%0A      [32m+[0m[0m ipv6_cidr_block_network_border_group = (known after apply)%0A      [32m+[0m[0m main_route_table_id                  = (known after apply)%0A      [32m+[0m[0m owner_id                             = (known after apply)%0A      [32m+[0m[0m tags                                 = {%0A          [32m+[0m[0m "Name" = "sre-vpc"%0A        }%0A      [32m+[0m[0m tags_all                             = {%0A          [32m+[0m[0m "Name" = "sre-vpc"%0A        }%0A    }%0A%0A[1m  # helm_release.prom_stack[0m will be created%0A[0m  [32m+[0m[0m resource "helm_release" "prom_stack" {%0A      [32m+[0m[0m atomic                     = false%0A      [32m+[0m[0m chart                      = "kube-prometheus-stack"%0A      [32m+[0m[0m cleanup_on_fail            = false%0A      [32m+[0m[0m create_namespace           = false%0A      [32m+[0m[0m dependency_update          = false%0A      [32m+[0m[0m disable_crd_hooks          = false%0A      [32m+[0m[0m disable_openapi_validation = false%0A      [32m+[0m[0m disable_webhooks           = false%0A      [32m+[0m[0m force_update               = false%0A      [32m+[0m[0m id                         = (known after apply)%0A      [32m+[0m[0m lint                       = false%0A      [32m+[0m[0m manifest                   = (known after apply)%0A      [32m+[0m[0m max_history                = 0%0A      [32m+[0m[0m metadata                   = (known after apply)%0A      [32m+[0m[0m name                       = "monitoring"%0A      [32m+[0m[0m namespace                  = "monitoring"%0A      [32m+[0m[0m pass_credentials           = false%0A      [32m+[0m[0m recreate_pods              = false%0A      [32m+[0m[0m render_subchart_notes      = true%0A      [32m+[0m[0m replace                    = false%0A      [32m+[0m[0m repository                 = "https://prometheus-community.github.io/helm-charts"%0A      [32m+[0m[0m reset_values               = false%0A      [32m+[0m[0m reuse_values               = false%0A      [32m+[0m[0m skip_crds                  = false%0A      [32m+[0m[0m status                     = "deployed"%0A      [32m+[0m[0m timeout                    = 300%0A      [32m+[0m[0m values                     = [%0A          [32m+[0m[0m <<-EOT%0A                grafana:%0A                  adminPassword: "admin123"%0A                  service:%0A                    type: NodePort%0A                    nodePort: 32000%0A                prometheus:%0A                  service:%0A                    type: NodePort%0A                    nodePort: 32001%0A            EOT,%0A        ]%0A      [32m+[0m[0m verify                     = false%0A      [32m+[0m[0m version                    = "47.3.0"%0A      [32m+[0m[0m wait                       = true%0A      [32m+[0m[0m wait_for_jobs              = false%0A    }%0A%0A[1m  # kubernetes_namespace.application[0m will be created%0A[0m  [32m+[0m[0m resource "kubernetes_namespace" "application" {%0A      [32m+[0m[0m id                               = (known after apply)%0A      [32m+[0m[0m wait_for_default_service_account = false%0A%0A      [32m+[0m[0m metadata {%0A          [32m+[0m[0m generation       = (known after apply)%0A          [32m+[0m[0m name             = "application"%0A          [32m+[0m[0m resource_version = (known after apply)%0A          [32m+[0m[0m uid              = (known after apply)%0A        }%0A    }%0A%0A[1m  # kubernetes_namespace.monitoring[0m will be created%0A[0m  [32m+[0m[0m resource "kubernetes_namespace" "monitoring" {%0A      [32m+[0m[0m id                               = (known after apply)%0A      [32m+[0m[0m wait_for_default_service_account = false%0A%0A      [32m+[0m[0m metadata {%0A          [32m+[0m[0m generation       = (known after apply)%0A          [32m+[0m[0m name             = "monitoring"%0A          [32m+[0m[0m resource_version = (known after apply)%0A          [32m+[0m[0m uid              = (known after apply)%0A        }%0A    }%0A%0A[1mPlan:[0m 13 to add, 0 to change, 0 to destroy.%0A[0m%0AChanges to Outputs:%0A  [32m+[0m[0m grafana_port_forward_command = "kubectl port-forward -n monitoring svc/monitoring-grafana 3000:80"%0A[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0
```